Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 1)]               0         
_________________________________________________________________
text_vectorization (TextVect (None, 200)               0         
_________________________________________________________________
embedding (Embedding)        (None, 200, 16)           320000    
_________________________________________________________________
conv1d (Conv1D)              (None, 65, 16)            1808      
_________________________________________________________________
global_max_pooling1d (Global (None, 16)                0         
_________________________________________________________________
dense (Dense)                (None, 256)               4352      
_________________________________________________________________
dropout (Dropout)            (None, 256)               0         
_________________________________________________________________
predictions (Dense)          (None, 40)                10280     
=================================================================
Total params: 336,440
Trainable params: 336,440
Non-trainable params: 0
_________________________________________________________________
